{
  "abstract": {
    "title": "Abstract",
    "content": [
      "The analog capstone was a schematic-only wireline transceiver built to AMD's 12.5 Gb/s specification in FreePDK 45nm. We used a 12\" channel model that seriously degraded the signal to the point that it would need equalization to properly transmit.",
      "I was on a team with 6 people, where each person had a block in this mixed-signal system. There were 6 blocks in our system:",
      "1. Serializer",
      "2. CM Driver",
      "3. FIR Filter",
      "4. CTLE Filter",
      "5. StrongARM Latch",
      "6. Deserializer",
      "I was in charge of overall equalization specifications, which I calculated using a Matlab model. I then helped in the design of the FIR filter by working with the CM driver."  
    ],
    "image": {
      "caption": "Overall Cadence schematic"
    }
  },
  "approach": {
    "title": "System Design",
    "content": [
      "I was in charge of determining system parameters for equalization. This meant solving a convolutiona matrix to find the optimal tap values for the FIR filter and optimal pole and zero locations for CTLE. The goal was to minimize ISIs and therefore open the channel eye as far as possible.",
      "I used the Matlab SerDes toolbox to design the system. I had a formula for ideal tap weights, and since we knew the channel impulse response already, I simply swept the pole and zero locations for CTLE and computed ideal tap weights for each pair of values. Once that was done, I plotted the eye diagram height and together we picked the most achievable design that would still give us a large eye opening.",
      "At right is the Matlab plot we referenced with a 3-tap FIR filter with no pre-taps. It is clear that the eye diagram opens wider with certain pole and zero locations, but these come at the expense of high power. There is also a discontinuity that I cannot explain."
    ],
    "image": {
      "caption": "Matlab eye opening vs. pole and zero locations"
    }
  },
  "results": {
    "title": "Results",
    "content": [
      "In the end, we were able to serialize and deserialize data at 12.5 Gb/s. The main digital problem was how to use flip flops that were fast enough to serialize the data, but the use of TSPC flip flops and latches solved that problem. The eye opening was not quite as wide as Matlab predicted, but it was plenty wide enough to successfully transmit data.",
      "We did have to make several assumptions for this to work. For one, we did not deal with correct clocking of the circuit at all, which could easily have covered another class. We used ideally matched clocks to recover data. We also did not run Monte Carlo or corner analysis, nor did we lay out either Tx or Rx blocks.",
      "Part of this stop in the project was the scope of the class. Part of it was that one of the other members of the team (Eugene) and I were also working on our digital capstone at the time, which took much more of our time, so we could not focus on this project as much as we wanted to."
    ],
    "image": {
      "caption": "Final eye diagram"
    }
  }
}
